// #j693ca8
//
// – створити інпут, який приймає вік людини, та кнопку, яка підтверджує дію. При натисканні на кнопку зчитати інформацію з інпуту та перевірити вік, чи менше він за 18, та повідомити про це користувача

let f1 = document.forms.f1
f1.onsubmit = function () {
    let age = f1.username.value;
    if (age >= 18) {
        alert(`Друже твій вік - ${age}, ти вже повнолітній`);
    }else if (age >0 && age <= 18) {
        alert(`Друже твій вік - ${age}, як казав Каю: "Я поки що малюк вивчати світ люблю..."`)
    }else{
        alert('Щось не те ти вів друже')
    }
}